from tasks.sorts.bubble_sort.solution_bubble import bubble_sort


def test_bubble() -> None:
    assert callable(bubble_sort)

    """
        Тест: уже отсортированный массив.
        Ожидается: 1 вывод исходного массива.
    """
    assert bubble_sort([1, 2, 3, 4, 5]) == [[1, 2, 3, 4, 5]]

    """
        Тест: уже отсортированный массив.
        Ожидается: 1 вывод исходного массива.
    """
    expected = [
        [7, 6, 5, 4, 3, 2, 1, 9],  # первый проход
        [6, 5, 4, 3, 2, 1, 7, 9],  # второй проход
        [5, 4, 3, 2, 1, 6, 7, 9],  # третий проход
        [4, 3, 2, 1, 5, 6, 7, 9],  # четвертый проход
        [3, 2, 1, 4, 5, 6, 7, 9],  # пятый проход
        [2, 1, 3, 4, 5, 6, 7, 9],  # шестой проход
        [1, 2, 3, 4, 5, 6, 7, 9],  # седьмой проход
    ]
    assert bubble_sort([9, 7, 6, 5, 4, 3, 2, 1]) == expected[:7]

    """
        Тест: массив с отрицательными числами.
    """
    assert bubble_sort([0, -5, 3, -1, -3]) == [
        [-5, 0, -1, -3, 3],  # первый проход
        [-5, -1, -3, 0, 3],  # второй проход
        [-5, -3, -1, 0, 3],  # третий проход
    ]

    """
        Тест: массив с дублями.
    """
    expected = [
        [3, 0, 42, 7, 0, 42, 42],  # первый проход
        [0, 3, 7, 0, 42, 42, 42],  # второй проход
        [0, 3, 0, 7, 42, 42, 42],  # третий проход
        [0, 0, 3, 7, 42, 42, 42],  # четвертый проход
    ]
    assert bubble_sort([42, 3, 0, 42, 7, 0, 42]) == expected[:4]

    """
        Тест: массив с минимальным количеством элементов.
    """
    assert bubble_sort([2, 1]) == [[1, 2]]
    assert bubble_sort([1, 2]) == [[1, 2]]

    """
        Тест: один элемент не на месте.
    """
    assert bubble_sort([1, 3, 2, 4, 5]) == [[1, 2, 3, 4, 5]]

    """
        Тест: пример1.
    """
    assert bubble_sort([3, 7, 9, 4, 3, 1, 8, 5]) == [
        [3, 7, 4, 3, 1, 8, 5, 9],
        [3, 4, 3, 1, 7, 5, 8, 9],
        [3, 3, 1, 4, 5, 7, 8, 9],
        [3, 1, 3, 4, 5, 7, 8, 9],
        [1, 3, 3, 4, 5, 7, 8, 9],
    ]

    """
        Тест: длина массива не удовлетворяет ограничениям.
    """
    assert bubble_sort([1]) == 0
